/*
 * Длина стороны нашего правильного шестиугольника равна 2 см. Получили ли мы правильный ответ? Просто
 * выполните прикидочные вычисления. Возьмите лист бумаги и набросайте эскиз. Не считайте это занятием
 * ниже своего достоинства. Многие знаменитые ученые восхищали людей своими способнностями получать 
 * примерный ответ с помощью карандаша и клочка бумаги (или салфетки). Эта способность (на самом деле -
 * простая привычка) может сэкономить массу времени и помочь избежать массы неприятностей.
 * 
 * Да, мы получили правильный ответ.
 */