/*
 * Определите класс Group, служащий контейнером объектов класса Shape с соответствующими операциями над
 * членами класса Group. Указание: Vector_ref. Используя класс Group, определите класс, рисующий шахматную
 * доску, по которой под управлением программы могут перемещаться шашки.
 *
 * P.S. Я вообще не понял сути этого задания, а конкретно при чём здесь вообще шахматная доска и зачем для
 * передвижения шашек нам реализовывать класс Group, если шашки (объекты класса Circle) можно просто хранить
 * в Vector_ref и при необходимости обращаться к любому объекту...
 */
