/*
 * С другой стороны, почему мы не должны иметь возможности найти простое решение этой задачи? Она не 
 * выглядит слишком уж сложной. Если даже ничего не получится, такая попытка позволит глубже понять задачу
 * и ее окончательное решение. Рассмотрим, что мы можем сделать прямо сейчас. Взглянем, например, на
 * строку 12.5+2. Ее можно разбить на лексемы, понять, что выражение простое, и вычислить ответ. Это
 * может оказаться несколько запутанным, но при этом достаточно прямым решением, поэтому, возможно,
 * следовало бы попробовать пойти в этом направлении! Подумайте, что следует делать, если строка содержит
 * операции + и *, как в выражении 2+3*4. Его также можно вычислить с помощью "грубой силы". Но что делать
 * с более сложным выражением, например 1+2*3/4%5+(6-7*(8))? И как выявлять ошибки, такие как 2+*3 и 2&3?
 * Подумайте об этом. Будет неплохо, если вы опишете на бумаге возможные решения для интересных или 
 * важных арифметических выражений.
 */